In [2]:
import numpy as np
import pandas as pd

In [5]:
s = pd.Series([1, 3, 5, np.nan, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    8.0
dtype: float64

In [6]:
dates = pd.date_range('20180312', periods=6)
dates

DatetimeIndex(['2018-03-12', '2018-03-13', '2018-03-14', '2018-03-15',
               '2018-03-16', '2018-03-17'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2018-03-12 -0.115835  1.518493  1.179542  1.593013
2018-03-13  0.759541 -0.668306  1.335360  1.072322
2018-03-14  0.235752  1.263220 -1.153892  2.056240
2018-03-15  0.031882  0.519852  0.978326 -0.218349
2018-03-16  0.413365  0.811383 -0.560488  1.138090
2018-03-17 -0.268854 -2.958245  0.048695 -0.943526

In [8]:
df2 = pd.DataFrame({'A': 1.,
                        'B': pd.Timestamp('20130102'),
                        'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                        'D': np.array([3] * 4, dtype='int32'),
                        'E': pd.Categorical(["test", "train", "test", "train"]),
                        'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [10]:
df.head()

                   A         B         C         D
2018-03-12 -0.115835  1.518493  1.179542  1.593013
2018-03-13  0.759541 -0.668306  1.335360  1.072322
2018-03-14  0.235752  1.263220 -1.153892  2.056240
2018-03-15  0.031882  0.519852  0.978326 -0.218349
2018-03-16  0.413365  0.811383 -0.560488  1.138090

In [11]:
df.tail()

                   A         B         C         D
2018-03-13  0.759541 -0.668306  1.335360  1.072322
2018-03-14  0.235752  1.263220 -1.153892  2.056240
2018-03-15  0.031882  0.519852  0.978326 -0.218349
2018-03-16  0.413365  0.811383 -0.560488  1.138090
2018-03-17 -0.268854 -2.958245  0.048695 -0.943526

In [12]:
df.index

DatetimeIndex(['2018-03-12', '2018-03-13', '2018-03-14', '2018-03-15',
               '2018-03-16', '2018-03-17'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [14]:
df.to_numpy()

array([[-0.11583453,  1.51849277,  1.17954211,  1.59301258],
       [ 0.75954122, -0.66830603,  1.33536038,  1.07232247],
       [ 0.23575248,  1.26322037, -1.15389167,  2.05624011],
       [ 0.03188176,  0.5198523 ,  0.97832631, -0.2183492 ],
       [ 0.41336532,  0.81138335, -0.56048811,  1.13809039],
       [-0.26885369, -2.95824458,  0.04869457, -0.94352649]])

In [15]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [16]:
df.T

   2018-03-12  2018-03-13  2018-03-14  2018-03-15  2018-03-16  2018-03-17
A   -0.115835    0.759541    0.235752    0.031882    0.413365   -0.268854
B    1.518493   -0.668306    1.263220    0.519852    0.811383   -2.958245
C    1.179542    1.335360   -1.153892    0.978326   -0.560488    0.048695
D    1.593013    1.072322    2.056240   -0.218349    1.138090   -0.943526

In [17]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2018-03-12  1.593013  1.179542  1.518493 -0.115835
2018-03-13  1.072322  1.335360 -0.668306  0.759541
2018-03-14  2.056240 -1.153892  1.263220  0.235752
2018-03-15 -0.218349  0.978326  0.519852  0.031882
2018-03-16  1.138090 -0.560488  0.811383  0.413365
2018-03-17 -0.943526  0.048695 -2.958245 -0.268854

In [18]:
df.sort_values(by='B')

                   A         B         C         D
2018-03-17 -0.268854 -2.958245  0.048695 -0.943526
2018-03-13  0.759541 -0.668306  1.335360  1.072322
2018-03-15  0.031882  0.519852  0.978326 -0.218349
2018-03-16  0.413365  0.811383 -0.560488  1.138090
2018-03-14  0.235752  1.263220 -1.153892  2.056240
2018-03-12 -0.115835  1.518493  1.179542  1.593013

In [19]:
df['A']

2018-03-12   -0.115835
2018-03-13    0.759541
2018-03-14    0.235752
2018-03-15    0.031882
2018-03-16    0.413365
2018-03-17   -0.268854
Freq: D, Name: A, dtype: float64

In [20]:
df[0:3]

                   A         B         C         D
2018-03-12 -0.115835  1.518493  1.179542  1.593013
2018-03-13  0.759541 -0.668306  1.335360  1.072322
2018-03-14  0.235752  1.263220 -1.153892  2.056240

In [21]:
df.loc[dates[0]]

A   -0.115835
B    1.518493
C    1.179542
D    1.593013
Name: 2018-03-12 00:00:00, dtype: float64